
#include <iostream>
#include <string>
using namespace std;

void printStatus(string name, int stat[]) {
    cout << "\n" << "<" << name << ">" << "\n\n";
    cout << "체력: " << stat[0] << "\n";
    cout << "총알: " << stat[1] << "\n";
    cout << "명중률: " << stat[2] << "\n";
    cout << "장갑도: " << stat[3] << "\n";
}

int main()
{
    string name;
    const int SIZE = 4;
    int stat[SIZE] = { 0 }; // [0] HP, [1] AMMO, [2] ATK, [3] DEF
    cout << "================================================================================\n";
    cout << "                           [ †B lack D ead R edemti●n† ]\n";
    cout << "================================================================================\n";

    cout << "\n???: 이보게 잘생긴 총잡이, 당신 이름이 뭐요?  \n";
    cout << "나 : ";
    getline(cin, name);

    cout << "\n???: 어디보자.. 체력은 어떤가? 총알은 얼마나 남았고? (두 스탯을 51-80 사이로 입력하시오.)  \n";
    while (true) {
        cout << "나 : ";
        cin >> stat[0] >> stat[1];
        if (stat[0] > 50 && stat[0] <= 80 && stat[1] > 50 && stat[1] <= 80) break;
        cout << "???: 적절치 않군... 다시 생각해보게나. \n" << "\n";
    }

    cout << "\n???: 그리고... 명중률은? 장갑은 두껍고? (두 스탯을 51-80 사이로 입력하시오.)  \n";
    while (true) {
        cout << "나 : ";
        cin >> stat[2] >> stat[3];
        if (stat[2] > 50 && stat[2] <= 80 && stat[3] > 50 && stat[3] <= 80) break;
        cout << "???: 적절치 않군... 다시 생각해보게나. \n";
    }
    cout << "---------------------------------------------------------------------------------\n";
    cout << "                                      [Status]";
    printStatus(name, stat);
    cout << "---------------------------------------------------------------------------------\n";

    int H_Potion = 5;
    int M_Potion = 5;
    bool isGameStart = false;
    int choice = 0;



    while (!isGameStart) {
        cout << "< 캐릭터 강화 >\n" << " 1. HP UP " << " 2. AMMO UP " << " 3. 공격력 2배 \n" << " 4. 방어력 2배 " << " 5. 현재능력치 " << " 0. 게임 시작 \n\n" << "입력: ";
        cin >> choice;
        cout << "\n" << "---------------------------------------------------------------------------------\n";
        switch (choice) {
        case 0: 
            cout << "게임을 시작합니다앗!";
            isGameStart = true;
            break;
        case 1: if (H_Potion > 0) {
            stat[0] += 20;
            H_Potion -= 1;
            cout << "HP 포션을 사용했습니다. (남은 포션: " << H_Potion << "개)\n";
            cout << "---------------------------------------------------------------------------------\n";
        }    

              else {
            cout << "HP 포션이 부족합니다. \n\n";
            cout << "---------------------------------------------------------------------------------\n";

        }
            break;
        case 2: if (M_Potion > 0) {
            stat[1] += 20;
            M_Potion -= 1;
            cout << "MP 포션을 사용했습니다. (남은 포션: " << M_Potion << "개)\n";
            cout << "---------------------------------------------------------------------------------\n";
        }
              else {
            cout << "MP 포션이 부족합니다. \n\n";
            cout << "---------------------------------------------------------------------------------\n";

        }
            break;
        case 3: stat[2] *= 2;
            cout << "공격력이 올랐습니다. \n";
            cout << "---------------------------------------------------------------------------------\n";
            break;
        case 4: stat[3] *= 2;
            cout << "방어력이 올랐습니다. \n";
            cout << "---------------------------------------------------------------------------------\n";
            break;
        case 5: printStatus(name, stat);
            cout << "\n";
            break;

        }
    }


    return 0;
}   
